# Mengganti nama Kolom Pada Data Frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [3]:
rows = 4
col = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(rows, col)),columns=cols)
df

   A  B  C  D  E
0  8  4  6  1  8
1  7  5  6  5  7
2  8  9  9  9  4
3  1  2  8  4  4

## Mengganti nama untuk salah satu kolom pada data frame

In [4]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  8  4     6  1  8
1  7  5     6  5  7
2  8  9     9  9  4
3  1  2     8  4  4

## Mengganti nama untuk beberapa kolom pada data frame

In [5]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'C':'Umur','D':'Tgl lahir','E':'Kota'})

   Nama  Alamat  Umur  Tgl lahir  Kota
0     8       4     6          1     8
1     7       5     6          5     7
2     8       9     9          9     4
3     1       2     8          4     4